***** Question
:PROPERTIES:
:CREATED: [2023-01-04 15:06:39 -05]
:END:

What's the meaning of "将" in this exercise?

黄律师，下周六晚上我们公司要举办一场舞会，我们经理想邀请您和您妻子参加，您那时候有时间吗？

★ 舞会➡️将⬅️在这个礼拜天举行。



#+begin_src dash
grep '^. 将 ' '/home/beep1560/my/misc/chinese-resources/Miscelanous/cedict__2022-12-23T01:28:26Z__121410.u8'
#+end_src

#+RESULTS:
#+begin_example
將 将 [jiang1] /will/shall/to use/to take/to checkmate/just a short while ago/(introduces object of main verb, used in the same way as 把[ba3])/
將 将 [jiang4] /general/commander-in-chief (military)/king (chess piece)/to command/to lead/
將 将 [qiang1] /to desire/to invite/to request/
#+end_example

